<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input_2" type="Parameter" version="opset1">
			<data shape="1,28,28,1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0,Func/StatefulPartitionedCall/input/_0:0,input_2,input_2:0">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_12" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Transpose_14" type="Const" version="opset1">
			<data element_type="f32" shape="8, 1, 3, 3" offset="32" size="288" />
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Convolution_15" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Relu_345" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="MaxPool_22" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>8</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Transpose_28" type="Const" version="opset1">
			<data element_type="f32" shape="64, 8, 3, 3" offset="320" size="18432" />
			<output>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Convolution_29" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>8</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Relu_353" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="MaxPool_36" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="2, 2" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_37" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="18752" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model_1/max_pooling2d_3/MaxPool" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>6</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/dropout_1/Identity,StatefulPartitionedCall/model_1/dropout_1/Identity:0,StatefulPartitionedCall/model_1/max_pooling2d_3/MaxPool,StatefulPartitionedCall/model_1/max_pooling2d_3/MaxPool:0">
					<dim>1</dim>
					<dim>6</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/model_1/flatten_1/Const" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="18784" size="16" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/model_1/flatten_1/Const,StatefulPartitionedCall/model_1/flatten_1/Const:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/model_1/flatten_1/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/flatten_1/Reshape,StatefulPartitionedCall/model_1/flatten_1/Reshape:0">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_1473" type="Const" version="opset1">
			<data element_type="f32" shape="128, 2304" offset="18800" size="1179648" />
			<output>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model_1/dense_2/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>2304</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/dense_2/BiasAdd,StatefulPartitionedCall/model_1/dense_2/BiasAdd:0,StatefulPartitionedCall/model_1/dense_2/MatMul,StatefulPartitionedCall/model_1/dense_2/MatMul:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model_1/dense_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/model_1/dense_2/Relu,StatefulPartitionedCall/model_1/dense_2/Relu:0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_1477" type="Const" version="opset1">
			<data element_type="f32" shape="10, 128" offset="1198448" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/model_1/dense_3/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/model_1/dense_3/BiasAdd,StatefulPartitionedCall/model_1/dense_3/BiasAdd:0,StatefulPartitionedCall/model_1/dense_3/MatMul,StatefulPartitionedCall/model_1/dense_3/MatMul:0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/model_1/dense_3/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="Func/StatefulPartitionedCall/output/_9,Func/StatefulPartitionedCall/output/_9:0,Identity,Identity:0,StatefulPartitionedCall/Identity,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/model_1/dense_3/Softmax,StatefulPartitionedCall/model_1/dense_3/Softmax:0">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Identity:0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="4" from-port="2" to-layer="5" to-port="0" />
		<edge from-layer="5" from-port="1" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="8" to-port="0" />
		<edge from-layer="7" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="17" to-port="0" />
		<edge from-layer="17" from-port="1" to-layer="19" to-port="0" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="20" from-port="1" to-layer="21" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2023.0.1-11005-fa1c41994f3-releases/2023/0" />
		<Runtime_version value="2023.0.1-11005-fa1c41994f3-releases/2023/0" />
		<conversion_parameters>
			<input_model value="DIR/frozen_graph.pb" />
			<input_shape value="[1, 28, 28, 1]" />
			<is_python_api_used value="False" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
